In [1]:
# import libraries
import pandas as pd

# import dataframe
df = pd.read_csv("people_analytics_updated.csv")

In [12]:
# df.shape shows us the total number of rows and columns
print(df.shape)

(4138, 20)

In [3]:
# print information about the DataFrame 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4138 entries, 0 to 4137
Data columns (total 24 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   employee_id           4138 non-null   int64
 1   department            4138 non-null   int64
 2   sub-department        4138 non-null   float64
 3   first_level_manager   4138 non-null   object
 4   second_level_manager  4030 non-null   float64
 5   third_level_manager   3679 non-null   object
 6   fourth_level_manager  3093 non-null   float64
 7   job_level             4138 non-null   object
 8   gender                4138 non-null   object
 9   sexual_orientation    4138 non-null   object
 10  race                  4138 non-null   object
 11  age                   4138 non-null   int64
 12  education             4138 non-null   object
 13  location              4138 non-null   object
 14  location_city         4138 non-null   object
 15  marital_status        4138 non-null   object
 16  employment_status     4138 non-null   object
 17  salary                4138 non-null   int64
 18  hire_date             4138 non-null   object
 19  term_date             4138 non-null   object
 20  years_of_service      4138 non-null   int64
 21  term_type             4138 non-null   object
 22  term_reason           4138 non-null   object
 23  Employee Status       4138 non-null   int64
dtypes: float64(3), int64(6), object(15)
memory usage: 776.0+ KB

In [4]:
# Remove the first-fourth level manager columns by using df.drop
df = df.drop('first_level_manager', axis=1)
df = df.drop('second_level_manager', axis=1)
df = df.drop('third_level_manager', axis=1)
df = df.drop('fourth_level_manager', axis=1)

In [6]:
# The primary objective of the project is to predict voluntary turnover, so let's see how much data
# there is of involuntary. If there isn't a signifcant amount, these rows related to involuntary turnover can be deleted

df['term_type'].value_counts()

0              3409
Voluntary       599
Involuntary     130
Name: term_type, dtype: int64

In [9]:
# Same data as above in percentages
# Involuntary resignations only make up of 3% of the total data
df['term_type'].value_counts(normalize=True)

0              0.823828
Voluntary      0.144756
Involuntary    0.031416
Name: term_type, dtype: float64

In [16]:
# drop the rows that contain involuntary in the term_type column
df.drop(df[df['term_type'] == 'Involuntary'].index, inplace = True)

In [17]:
# double check the number of rows. 
# 4138 original - 130 containing involuntary resignations, = 4008 rows
print(df.shape)

(4008, 20)

In [ ]:
# Start label coding all columns that are object types except the hire_date and term_date columns

In [18]:
df = df.replace({'job_level' : {'Manager': 0, 'Individual Contributor': 1, 'Team Lead': 2, 'Director': 3, 'CEO': 4}})

print(df['job_level'].unique())

[0 1 2 3 4]

In [20]:
df = df.replace({'gender' : {'Male': 0, 'Female': 1, 'Other': 2}})

print(df['gender'].unique())

[0 1 2]

In [21]:
df = df.replace({'sexual_orientation' : {'Heterosexual': 0, 'Gay': 1, 'Bisexual': 2, 'Lesbian': 3, 'Other': 4}})

print(df['sexual_orientation'].unique())

[0 1 2 3 4]

In [22]:
df = df.replace({'race' : {'Caucasian': 0, 'African American': 1, 'Other': 2, 'Asian': 3, 'Hispanic': 4, 'Native American': 5}})

print(df['race'].unique())

[0 1 2 3 4 5]

In [23]:
df = df.replace({'education' : {"Associate's degree": 0, "Bachelor's degree": 1, "Master's degree": 2, "None": 3}})

print(df['education'].unique())

[1 2 0 3]

In [24]:
df = df.replace({'location' : {'Remote': 0, 'On-site': 1}})

print(df['location'].unique())

[0 1]

In [25]:
df = df.replace({'location_city' : {'Austin': 0, 'Boston': 1, 'Charlotte': 2, 'Chicago': 3, 
                                    'Columbus': 4, 'Dallas': 5, 'Denver': 6, 'Fort Worth': 7, 'Houston': 8,
                                    'Indianapolis': 9, 'Jacksonville': 10, 'Los Angeles': 11, 'New York': 12,
                                    'Philadelphia': 13, 'Phoenix': 14, 'San Antonio': 15, 'San Diego': 16, 
                                    'San Francisco': 17, 'San Jose': 18, 'Seattle': 19, 'Washington DC': 20}})
print(df['location_city'].unique())

[18  3  0 19 15  9 11 20  7  8 16 17 10 13 14  5  6  4  1  2 12]

In [26]:
df = df.replace({'marital_status' : {'Married': 1, 'Single': 0}})

print(df['marital_status'].unique())

[1 0]

In [27]:
df = df.replace({'employment_status' : {'Full Time': 0, 'Contract': 1}})

print(df['employment_status'].unique())

[0 1]

In [33]:
df = df.replace({'term_reason' : {'0': 0, 'Better salary': 1.1, 'Career change': 1.2, 'Found a better opportunity': 1.3,
                                  'More flexible benefits': 1.4, 'Personal reasons': 1.5, 'Relocation': 1.6}})

print(df['term_reason'].unique())

[0.  1.4 1.3 1.6 1.1 1.5 1.2]

In [35]:
print(df['term_type'].unique())

['0' 'Voluntary']

In [40]:
df = df.replace({'term_type' : {'0': 0, 'Voluntary': 1}})

print(df['term_type'].unique())

[0 1]

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4008 entries, 0 to 4137
Data columns (total 20 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   employee_id         4008 non-null   int64
 1   department          4008 non-null   int64
 2   sub-department      4008 non-null   float64
 3   job_level           4008 non-null   int64
 4   gender              4008 non-null   int64
 5   sexual_orientation  4008 non-null   int64
 6   race                4008 non-null   int64
 7   age                 4008 non-null   int64
 8   education           4008 non-null   int64
 9   location            4008 non-null   int64
 10  location_city       4008 non-null   int64
 11  marital_status      4008 non-null   int64
 12  employment_status   4008 non-null   int64
 13  salary              4008 non-null   int64
 14  hire_date           4008 non-null   object
 15  term_date           4008 non-null   object
 16  years_of_service    4008 non-null   int64
 17  term_type           4008 non-null   int64
 18  term_reason         4008 non-null   float64
 19  Employee Status     4008 non-null   int64
dtypes: float64(2), int64(16), object(2)
memory usage: 657.6+ KB

In [42]:
df.columns = ['Employee ID', 'Department', 'Department Area', 'Degree of Leadership', 
              'Gender', 'Sexual Orientation', 'Race', 'Age', 'Education', 'Work Environment', 'City', 'Marital Status',
              'Full-Time or Contract', 'Salary', 'Hire Date', 'Termination Date', 'Years of Service', 'Termination Type', 'Termination Reason', 'Employee Status']

list(df.columns)

['Employee ID',
 'Department',
 'Department Area',
 'Degree of Leadership',
 'Gender',
 'Sexual Orientation',
 'Race',
 'Age',
 'Education',
 'Work Environment',
 'City',
 'Marital Status',
 'Full-Time or Contract',
 'Salary',
 'Hire Date',
 'Termination Date',
 'Years of Service',
 'Termination Type',
 'Termination Reason',
 'Employee Status']

In [43]:
df.head(10)

,Employee ID,Department,Department Area,Degree of Leadership,Gender,Sexual Orientation,Race,Age,Education,Work Environment,City,Marital Status,Full-Time or Contract,Salary,Hire Date,Termination Date,Years of Service,Termination Type,Termination Reason,Employee Status
0,4566010041,11,11.2,0,0,0,0,32,1,0,18,1,0,101989,6/28/17,0,5,0,0.0,0
1,7563277100,12,12.3,1,0,0,0,26,1,0,3,0,0,98059,5/27/12,0,10,0,0.0,0
2,901750037,3,3.1,1,0,0,0,26,1,0,0,1,0,65444,2/12/17,0,5,0,0.0,0
3,5969184373,6,6.3,1,1,0,0,40,1,0,19,0,0,90060,6/27/20,0,2,0,0.0,0
4,3294917953,12,12.1,1,1,0,1,41,1,0,15,0,0,56973,9/8/14,0,8,0,0.0,0
5,9733816619,3,3.3,1,1,0,2,41,2,0,9,0,0,59564,3/31/14,0,8,0,0.0,0
6,1363350907,12,12.3,1,0,0,1,38,1,1,11,0,0,72231,8/4/19,0,3,0,0.0,0
7,8079838913,4,4.3,1,1,0,0,38,1,0,20,0,0,54679,3/21/18,0,4,0,0.0,0
8,8456966186,0,0.1,1,1,0,0,24,1,0,20,0,0,56138,7/17/17,6/20/19,1,1,1.4,1
9,2266152100,8,8.3,1,1,0,0,40,1,0,7,0,0,64551,4/14/15,0,7,0,0.0,0

In [44]:
df.to_csv('people_data_clean.csv', index=False)